/**
 *  ! 자바스크립트 개발 환경 설정
 *
 *    1. 코드 작성 및 확인
 *
 *  ! 자바스크립트 표준 스타일
 *    자바스크립트 코딩 규칙
 *    = 스타일 가이드(코딩 컨벤션, 코딩 스타일, 표준 스타일)
 *    구글 또는 에어비엔비에서 배포한 것을 기준으로 작성
 *
 *    1. 코드 들여쓰기
 *      : 탭의 경우 시스템 환경마다 다르게 출력
 *      : 주로 space로 공백 2칸, 4칸 들여쓰기 권장 (공백 2칸 주로 사용)
 *    2. 세미콜론(;)으로 문장 구분
 *      : 세미콜론 없이도 실행 가능만 반드시 작성
 *      : 문장과 문장의 구분(명확하게 표시)
 *      : 소스 코드는 한 줄에 한 문장만 사용 권장
 *    3. 공백 사용(가독성)
 *      : 예약어, 연산자, 값 사이에는 공백을 넣어 소스코드의 가독성 향상을 권장
 *    4. 주석 작성
 */

// 콘솔창 출력
// 간단한 코드와 결괏값을 알고 싶은 경우 콘솔창 사용
// 에러 확인
console.log('hello world');
